import numpy as np
a= np.array([10,20,30,40])
b = np.arange(4)

print(a) # [10 20 30 40]
print(b) # [0 1 2 3]

c= a-b
print(c) # [10 19 28 37]
c = a+b
print(c) # [10 21 32 43]
c = b**2
print(c) # [0 1 4 9]
c = 10*np.sin(a)
print(c) # [-5.44021111  9.12945251 -9.88031624  7.4511316 ]
c = b<3
print(c) # [ True  True  True False]

a = np.array([[1,1],[0,1]])
b = np.arange(4).reshape((2,2))

c = a*b
c_dot = np.dot(a,b)
c_dot2 = a@b
# 矩阵乘法
print(a)
# [[1 1]
#  [0 1]]
print(b)
# [[0 1]
#  [2 3]]
print(c_dot)
# [[2 4]
#  [2 3]]
# 第 0 行第 0 列：\(1*0 + 1*2 = 2\)
# 第 0 行第 1 列：\(1*1 + 1*3 = 4\)
# 第 1 行第 0 列：\(0*0 + 1*2 = 2\)
# 第 1 行第 1 列：\(0*1 + 1*3 = 3\)
print(c_dot2)
# [[2 4]
#  [2 3]]

# 随记生成
a = np.random.random((2,4)) # 生成 0 ~ 1 之间的浮点数，不包含
print(a)
# [[0.3540154  0.4337458  0.56988017 0.1125812 ]
#  [0.35071351 0.0370024  0.30653227 0.71331758]]
print(np.sum(a)) # 4.641467556120334
print(np.min(a)) # 0.03749503202296234
print(np.max(a)) # 0.9618275922908691

# 通俗记：axis=0 → 竖着加（列求和）；axis=1 → 横着加（行求和）
print(np.sum(a,axis=0)) # 0是列1是行
# [0.41604279 0.46416065 1.03160589 1.65862059]
print(np.sum(a,axis=1))
# [1.0615849  2.50884503]